[
  {
    "name": "Roku",
    "image": "roku.png",
    "position": "Software Engineering Intern, Customer Interface",
    "date": "Jun '21 - Aug '21",
    "description": "Developed dashboards for new analytics suite in enterprise Angular application for advertisers and publishers. Implemented new high-priority feature requested by stakeholders that provided users with preset report templates. Improved navigation and routing, rewrote test suites, performed code review, practiced partner programming. Technologies used: Angular, Typescript, HTML, CSS, Mocha, Sinon, RxJS, AWS, Jenkins, GitHub, git."
  },
  {
    "name": "LastMile Retail",
    "image": "lastmile.jpg",
    "position": "Product Management Intern",
    "date": "Jun '20 - Aug '20",
    "description": "Developed user stories, product requirements, and wireframes for four new interfaces for customer facing product. Studied preexisting solutions and Facebook, Google, and Yelp API’s to define determinants of product-market fit. Interviewed customers and developers to inform designs, communicated with developers through implementation. Completed Ad-hoc data quality tasks, taking initiative to leverage Python scripting skills whenever possible."
  },
  {
    "name": "Indigo Agriculture",
    "image": "indigo.jpg",
    "position": "Software Engineering Intern, GeoInnovation Team",
    "date": "Jun '18 - May '20",
    "description": "Automated ingestion of 10 international crop reports that drive customer-facing yield models, yielding ~5 times more data per report. Backfilled hundreds of historical crop reports increasing database size by ~1000 times. Implemented Python feature that successfully detected and alerted on missing or anomalous data with PagerDuty."
  },
  {
    "name": "Indigo Agriculture",
    "image": "indigo.jpg",
    "position": "Software Engineering Intern, Developer Operations",
    "date": "Jun '18 - May '19",
    "description": "Designed, built, and deployed a Slack application to interface with an in-house developer tools CLI (used daily). Built components for web testing suite and implemented new feature in CircleCI to report all build/deploy times. Created Lambda function to report customer activity and dashboards in Datadog to analyze collected data. Continued working remotely through academic year to develop a central project index for developers using React."
  },
  {
    "name": "Pingup",
    "image": "pingup.jpg",
    "position": "Software Engineering Intern",
    "date": "Jul '17 - Aug '17",
    "description": "Implemented web-driven feature in Java backend to confirm customers’ businesses were bookable on publishers. Researched geotagging vendors and presented to team, created permutations of Alexa phrases using Python."
  },
  {
    "name": "Self-Employed",
    "image": "flybuy.jpg",
    "position": "Online Clothing and Shoes Reseller",
    "date": "Jan '16 - May '18",
    "description": "Started business to resell low-supply high-demand clothing and shoes. Revenue $40,000+ at 43% gross margins. Created product acquisition bots with Python, Selenium, and HTTP Proxies. Communicated with customers daily. Lead team of five entrepreneurs, managed hiring of developer and development of a restock-monitoring service."
  }
]