[
  {
    "image": "michaelcarini.jpg",
    "title": "Michael Carini",
    "subtitle": "LastMile Retail",
    "text": "As a summer associate product manager, Miles demonstrated a strong work ethic and excellent creative problem-solving ability. Leveraging his prior experience as a software engineer, Miles was able to successfully expand his skillset and grow into the role of product manager by working hard to learn the core principles of agile development and product-market fit.   For example, when asked to design a new customer-facing local advertising analytics interface from scratch, he was able to use his existing technical skills to not only document the Google and Facebook API’s the system was based on, but also successfully capture key business goals by interviewing stakeholders and finding comparative examples to develop initial wireframes and written product requirements documentation.  To Mile’s significant credit, he was able to produce high-quality, useful work from almost his first day on the job and demonstrated a maturity and work ethic rare for someone in a summer associate role. Miles was also able to synthesize constructive feedback very quickly. For example, learning to adapt his process to spend less time documenting technical features up front and instead honing the scope of his research only after business goals were clearly established.  We’re very sad to be losing Miles at the end of the summer, but are delighted to recommend him unequivocally as a strong contributor and great asset for any organization."
  },
  {
    "image": "jacobmcdonald.jpg",
    "title": "Jacob McDonald",
    "subtitle": "Indigo Agriculture",
    "text": "Miles spent the summer of 2019 at Indigo building a system to digitize decades worth of domestic and international agriculture reports. He ended up with a system that efficiently and correctly processed reports from a handful of different agencies and 50-odd formats (some reports seem to change formats every year) written in Python and deployed using Airflow.   After the summer, Miles stayed on for a few months part-time while he was back at school to add support for a couple more agencies. He was great to work with and produced quality code that still being used (and built upon). 5/5 stars. Would recommend."
  },
  {
    "image": "kelseysteinbeck.jpg",
    "title": "Kelsey Steinbeck",
    "subtitle": "Indigo Agriculture",
    "text": "Miles is a rare find. Not only is he very smart technically but he’s very personable. I could throw almost any task at him and I would feel confident that he will deliver (technical/leadership/mundane/whatever needs done). He’s adaptable, friendly, and hard-working.  He has a combination of traits that will make him a superstar in whatever area he goes into. Miles has the traits/skills where he can work anywhere he chooses and be successful, the hard part will be convincing Miles that your company/position is worth his time."
  },
  {
    "image": "nerminserifovic.jpg",
    "title": "Nermin Šerifović",
    "subtitle": "Pingup",
    "text": "I had a pleasure to have Miles as a summer intern on my team at Pingup. Even though a high school student, Miles was able to quickly grasp concepts and required minimal supervision. I was pleasantly surprised with his ability to find pragmatic solutions, and overall quality of his work. Therefore, I would recommend Miles without any reservations."
  }
]